---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.EnergyAnalysisMasszoneUseenergydatasettings
source: html/e60cc0a4-af0c-edde-e921-7f17f7f9baf0.htm
---
# Autodesk.Revit.DB.ParameterTypeId.EnergyAnalysisMasszoneUseenergydatasettings Property

"Use Energy Data"

## Syntax (C#)
```csharp
public static ForgeTypeId EnergyAnalysisMasszoneUseenergydatasettings { get; }
```